tutorials/incompressible/pimpleRemeshFoam/simple_0012/rotateControlFoil/0/R
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      R;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   uniform (0.0025 0 0 0.0025 0 0.0025);

boundaryField
{
    airfoil
    {
        type            fixedValue;
        value           uniform (0 0 0 0 0 0);
    }
    freestream
    {
        type            freestream;
        freestreamValue uniform (0.0025 0 0 0.0025 0 0.0025);
        value           uniform (0.0025 0 0 0.0025 0 0.0025);
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
