tutorials/incompressible/pimpleRemeshFoam/simple_0012/rotateControlFoil/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<scalar> 
11961
(
5.68981e-08
5.20408e-08
3.14818e-08
3.85206e-08
3.28861e-09
9.6358e-08
2.46568e-08
7.80296e-09
...
)
;

boundaryField
{
    airfoil
    {
        type            fixedValue;
        value           uniform 0;
    }
    freestream
    {
        type            fixedValue;
        value           uniform 3.75e-05;
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
